F S UID        PID  PPID  C PRI  NI ADDR SZ WCHAN  STIME TTY          TIME CMD
0 S luis     19395 19378  0  80   0 -  1044 -      16:58 pts/0    00:00:00 sh -c ./filter_make_empty mcblocklistsearch < mcblocklistsearch.stdout.out > vg_regtest.tmp.19378
Thu Mar  6 16:58:18 CET 2014
F S UID        PID  PPID  C PRI  NI ADDR SZ WCHAN  STIME TTY          TIME CMD
0 S luis     19402 19378  0  80   0 -  1044 -      16:58 pts/0    00:00:00 sh -c ./filter_make_empty mcblocklistsearch < mcblocklistsearch.stderr.out > vg_regtest.tmp.19378
Thu Mar  6 16:58:18 CET 2014
==19389== (action at startup) vgdb me ... 
==19389== 
==19389== TO DEBUG THIS PROCESS USING GDB: start GDB like this
==19389==   /path/to/gdb ./../memcheck/tests/leak-tree
==19389== and then give GDB the following command
==19389==   target remote | /home/luis/git/cojac-grind/cogrind-gitlab/.in_place/../../bin/vgdb --pid=19389 --vgdb-prefix=./vgdb-prefix-mcblocklistsearch
==19389== --pid is optional if only one valgrind process is running
==19389== 
==19389== Reset valgrind output to log (orderly_finish)
F S UID        PID  PPID  C PRI  NI ADDR SZ WCHAN  STIME TTY          TIME CMD
0 S luis     19409 19378  0  80   0 -  1044 -      16:58 pts/0    00:00:00 sh -c ./filter_make_empty mcblocklistsearch < mcblocklistsearch.stdoutB.out > vg_regtest.tmp.19378
Thu Mar  6 16:58:18 CET 2014
F S UID        PID  PPID  C PRI  NI ADDR SZ WCHAN  STIME TTY          TIME CMD
0 S luis     19602 19378  0  80   0 -  1044 -      16:58 pts/0    00:00:00 sh -c ./filter_make_empty mcbreak < mcbreak.stderr.out > vg_regtest.tmp.19378
Thu Mar  6 16:58:20 CET 2014
==19510== Memcheck, a memory error detector
==19510== Copyright (C) 2002-2013, and GNU GPL'd, by Julian Seward et al.
==19510== Using Valgrind-3.9.0 and LibVEX; rerun with -h for copyright info
==19510== Command: ./t
==19510== 
==19510== (action at startup) vgdb me ... 
==19510== 
==19510== TO DEBUG THIS PROCESS USING GDB: start GDB like this
==19510==   /path/to/gdb ./t
==19510== and then give GDB the following command
==19510==   target remote | /home/luis/git/cojac-grind/cogrind-gitlab/.in_place/../../bin/vgdb --pid=19510 --vgdb-prefix=./vgdb-prefix-mcbreak
==19510== --pid is optional if only one valgrind process is running
==19510== 
==19510== Conditional jump or move depends on uninitialised value(s)
==19510==    at 0x400C40: make_error (t.c:40)
==19510==    by 0x400CA0: level (t.c:50)
==19510==    by 0x400F90: main (t.c:122)
==19510== 
==19510== (action on error) vgdb me ... 
==19510== Continuing ...
==19510== Conditional jump or move depends on uninitialised value(s)
==19510==    at 0x400C40: make_error (t.c:40)
==19510==    by 0x400F9A: main (t.c:123)
==19510== 
==19510== (action on error) vgdb me ... 
==19510== Reset valgrind output to log (orderly_finish)
F S UID        PID  PPID  C PRI  NI ADDR SZ WCHAN  STIME TTY          TIME CMD
0 S luis     19984 19378  0  80   0 -  1044 -      16:58 pts/0    00:00:00 sh -c ./filter_make_empty mchelp < mchelp.stdout.out > vg_regtest.tmp.19378
Thu Mar  6 16:58:23 CET 2014
F S UID        PID  PPID  C PRI  NI ADDR SZ WCHAN  STIME TTY          TIME CMD
0 S luis     19991 19378  0  80   0 -  1044 -      16:58 pts/0    00:00:00 sh -c ./filter_make_empty mchelp < mchelp.stderr.out > vg_regtest.tmp.19378
Thu Mar  6 16:58:23 CET 2014
==19982== Memcheck, a memory error detector
==19982== Copyright (C) 2002-2013, and GNU GPL'd, by Julian Seward et al.
==19982== Using Valgrind-3.9.0 and LibVEX; rerun with -h for copyright info
==19982== Command: ./t
==19982== 
==19982== (action at startup) vgdb me ... 
==19982== 
==19982== TO DEBUG THIS PROCESS USING GDB: start GDB like this
==19982==   /path/to/gdb ./t
==19982== and then give GDB the following command
==19982==   target remote | /home/luis/git/cojac-grind/cogrind-gitlab/.in_place/../../bin/vgdb --pid=19982 --vgdb-prefix=./vgdb-prefix-mchelp
==19982== --pid is optional if only one valgrind process is running
==19982== 
==19982== Reset valgrind output to log (orderly_finish)
main ready to sleep and/or burn
F S UID        PID  PPID  C PRI  NI ADDR SZ WCHAN  STIME TTY          TIME CMD
0 S luis     20197 19378  0  80   0 -  1044 -      16:58 pts/0    00:00:00 sh -c ./filter_make_empty mcinfcallRU < mcinfcallRU.stdoutB.out > vg_regtest.tmp.19378
Thu Mar  6 16:58:26 CET 2014
Reading symbols from /home/luis/git/cojac-grind/cogrind-gitlab/gdbserver_tests/sleepers...done.
(gdb) (gdb) Remote debugging using | ./vgdb --wait=60 --vgdb-prefix=./vgdb-prefix-mcinfcallRU
Reading symbols from /lib64/ld-linux-x86-64.so.2...(no debugging symbols found)...done.
Loaded symbols for /lib64/ld-linux-x86-64.so.2
[Switching to Thread 20094]
0x0000000004000af0 in ?? () from /lib64/ld-linux-x86-64.so.2
(gdb) vgdb launched process attached
(gdb) (gdb) (gdb) (gdb) (gdb) (gdb) (gdb) Continuing.

Program received signal SIGTRAP, Trace/breakpoint trap.
0x0000000000400b1d in do_burn () at sleepers.c:39
39	   for (i = 0; i < burn; i++) loopnr++;
(gdb)   Id   Target Id         Frame 
* 1    Thread 20094 (tid 1 VgTs_Runnable) 0x0000000000400b1d in do_burn ()
    at sleepers.c:39
(gdb) 
Thread 1 (Thread 20094):
#0  0x0000000000400b1d in do_burn () at sleepers.c:39
        i = 81180786
        loopnr = 81180786
#1  0x0000000000400d2a in sleeper_or_burner (v=0xfff0000d0) at sleepers.c:87
        i = 0
        s = 0xfff0000d0
#2  0x000000000040117f in main (argc=5, argv=0xfff000258) at sleepers.c:189
        threads_spec = 0xfff00052d ""
        ebbr = 4196752
        egll = 0
        zzzz = 4198896
        b = {name = 0x4013d8 "Brussels", sleep = 0, burn = 0, t = -1}
        l = {name = 0x4013e1 "London", sleep = 0, burn = 0, t = -1}
        p = {name = 0x4013e8 "Petaouchnok", sleep = 0, burn = 0, t = -1}
        m = {name = 0x4013f4 "main", sleep = 0, burn = 1, t = 0}
        some_mem = 0x53d6040 ""
(gdb) (gdb) (gdb) (gdb) (gdb) $1 = void
(gdb) (gdb) F S UID        PID  PPID  C PRI  NI ADDR SZ WCHAN  STIME TTY          TIME CMD
0 S luis     20204 19378  0  80   0 -  1044 -      16:58 pts/0    00:00:00 sh -c ./filter_make_empty mcinfcallRU < mcinfcallRU.stderrB.out > vg_regtest.tmp.19378
Thu Mar  6 16:58:26 CET 2014
relaying data between gdb and process 20094
vgdb-error value changed from 0 to 999999
==20094== monitor command request to kill this process
Remote connection closed
main ready to sleep and/or burn
F S UID        PID  PPID  C PRI  NI ADDR SZ WCHAN  STIME TTY          TIME CMD
0 S luis     20448 19378  0  80   0 -  1044 -      16:58 pts/0    00:00:00 sh -c ./filter_make_empty mcinvokeRU < mcinvokeRU.stderr.out > vg_regtest.tmp.19378
Thu Mar  6 16:58:33 CET 2014
==20421== Memcheck, a memory error detector
==20421== Copyright (C) 2002-2013, and GNU GPL'd, by Julian Seward et al.
==20421== Using Valgrind-3.9.0 and LibVEX; rerun with -h for copyright info
==20421== Command: ./sleepers 1 0 1000000000 B-B-B-B-
==20421== 
loops/sleep_ms/burn/threads_spec:  1 0 1000000000 B-B-B-B-
Brussels ready to sleep and/or burn
London ready to sleep and/or burn
Petaouchnok ready to sleep and/or burn
main ready to sleep and/or burn
==20421== Reset valgrind output to log (orderly_finish)
F S UID        PID  PPID  C PRI  NI ADDR SZ WCHAN  STIME TTY          TIME CMD
0 S luis     20588 19378  0  80   0 -  1044 -      16:58 pts/0    00:00:00 sh -c ./filter_make_empty mcinvokeWS < mcinvokeWS.stderr.out > vg_regtest.tmp.19378
Thu Mar  6 16:58:40 CET 2014
==20551== Memcheck, a memory error detector
==20551== Copyright (C) 2002-2013, and GNU GPL'd, by Julian Seward et al.
==20551== Using Valgrind-3.9.0 and LibVEX; rerun with -h for copyright info
==20551== Command: ./sleepers 1 10000000 0 -S-S-S-S
==20551== 
loops/sleep_ms/burn/threads_spec:  1 10000000 0 -S-S-S-S
Brussels ready to sleep and/or burn
London ready to sleep and/or burn
Petaouchnok ready to sleep and/or burn
main ready to sleep and/or burn
==20551== Reset valgrind output to log (orderly_finish)
F S UID        PID  PPID  C PRI  NI ADDR SZ WCHAN  STIME TTY          TIME CMD
0 S luis     21423 19378  0  80   0 -  1044 -      16:58 pts/0    00:00:00 sh -c ./filter_make_empty mcsignopass < mcsignopass.stderrB.out > vg_regtest.tmp.19378
Thu Mar  6 16:58:46 CET 2014
relaying data between gdb and process 21270
vgdb-error value changed from 0 to 999999
F S UID        PID  PPID  C PRI  NI ADDR SZ WCHAN  STIME TTY          TIME CMD
0 S luis     21590 19378  0  80   0 -  1044 -      16:58 pts/0    00:00:00 sh -c ./filter_make_empty mcsigpass < mcsigpass.stderrB.out > vg_regtest.tmp.19378
Thu Mar  6 16:58:47 CET 2014
relaying data between gdb and process 21437
vgdb-error value changed from 0 to 999999
The program is not being run.
F S UID        PID  PPID  C PRI  NI ADDR SZ WCHAN  STIME TTY          TIME CMD
0 S luis     21610 19378  0  80   0 -  1044 -      16:58 pts/0    00:00:00 sh -c ./filter_make_empty mcvabits < mcvabits.stdout.out > vg_regtest.tmp.19378
Thu Mar  6 16:58:49 CET 2014
F S UID        PID  PPID  C PRI  NI ADDR SZ WCHAN  STIME TTY          TIME CMD
0 S luis     21617 19378  0  80   0 -  1044 -      16:58 pts/0    00:00:00 sh -c ./filter_make_empty mcvabits < mcvabits.stderr.out > vg_regtest.tmp.19378
Thu Mar  6 16:58:49 CET 2014
==21604== Memcheck, a memory error detector
==21604== Copyright (C) 2002-2013, and GNU GPL'd, by Julian Seward et al.
==21604== Using Valgrind-3.9.0 and LibVEX; rerun with -h for copyright info
==21604== Command: ./t
==21604== 
==21604== (action at startup) vgdb me ... 
==21604== 
==21604== TO DEBUG THIS PROCESS USING GDB: start GDB like this
==21604==   /path/to/gdb ./t
==21604== and then give GDB the following command
==21604==   target remote | /home/luis/git/cojac-grind/cogrind-gitlab/.in_place/../../bin/vgdb --pid=21604 --vgdb-prefix=./vgdb-prefix-mcvabits
==21604== --pid is optional if only one valgrind process is running
==21604== 
==21604== Reset valgrind output to log (orderly_finish)
F S UID        PID  PPID  C PRI  NI ADDR SZ WCHAN  STIME TTY          TIME CMD
0 S luis     21782 19378  0  80   0 -  1044 -      16:58 pts/0    00:00:00 sh -c ./filter_make_empty mcwatchpoints < mcwatchpoints.stdout.out > vg_regtest.tmp.19378
Thu Mar  6 16:58:51 CET 2014
F S UID        PID  PPID  C PRI  NI ADDR SZ WCHAN  STIME TTY          TIME CMD
0 S luis     21935 19378  0  80   0 -  1044 -      16:58 pts/0    00:00:00 sh -c ./filter_make_empty mcwatchpoints < mcwatchpoints.stderrB.out > vg_regtest.tmp.19378
Thu Mar  6 16:58:51 CET 2014
relaying data between gdb and process 21777
vgdb-error value changed from 0 to 999999
F S UID        PID  PPID  C PRI  NI ADDR SZ WCHAN  STIME TTY          TIME CMD
0 S luis     21950 19378  0  80   0 -  1044 -      16:58 pts/0    00:00:00 sh -c ./filter_make_empty mssnapshot < mssnapshot.stdout.out > vg_regtest.tmp.19378
Thu Mar  6 16:58:51 CET 2014
F S UID        PID  PPID  C PRI  NI ADDR SZ WCHAN  STIME TTY          TIME CMD
0 S luis     21958 19378  0  80   0 -  1044 -      16:58 pts/0    00:00:00 sh -c ./filter_make_empty mssnapshot < mssnapshot.stderr.out > vg_regtest.tmp.19378
Thu Mar  6 16:58:51 CET 2014
valgrind: failed to start tool 'massif' for platform 'amd64-linux': No such file or directory
main ready to sleep and/or burn
(gdb) (gdb) (gdb) (gdb) (gdb) changed burning parameters
F S UID        PID  PPID  C PRI  NI ADDR SZ WCHAN  STIME TTY          TIME CMD
0 S luis     22227 19378  0  80   0 -  1044 -      16:59 pts/0    00:00:00 sh -c ./filter_make_empty nlcontrolc < nlcontrolc.stderrB.out > vg_regtest.tmp.19378
Thu Mar  6 16:59:06 CET 2014
relaying data between gdb and process 22090
vgdb-error value changed from 0 to 999999
82	../sysdeps/unix/syscall-template.S: No such file or directory.
F S UID        PID  PPID  C PRI  NI ADDR SZ WCHAN  STIME TTY          TIME CMD
0 S luis     23164 19378  0  80   0 -  1044 -      16:59 pts/0    00:00:00 sh -c ./filter_make_empty nlself_invalidate < nlself_invalidate.stdoutB.out > vg_regtest.tmp.19378
Thu Mar  6 16:59:14 CET 2014
Reading symbols from /home/luis/git/cojac-grind/cogrind-gitlab/gdbserver_tests/self_invalidate...done.
(gdb) (gdb) Remote debugging using | ./vgdb --wait=60 --vgdb-prefix=./vgdb-prefix-nlself_invalidate
Reading symbols from /lib64/ld-linux-x86-64.so.2...(no debugging symbols found)...done.
Loaded symbols for /lib64/ld-linux-x86-64.so.2
[Switching to Thread 23133]
0x0000000004000af0 in ?? () from /lib64/ld-linux-x86-64.so.2
(gdb) vgdb launched process attached
(gdb) (gdb) Breakpoint 1 at 0x400506: file self_invalidate.c, line 10.
(gdb) (gdb) Continuing.

Breakpoint 1, 0x0000000000400506 in main () at self_invalidate.c:10
10	__asm__ __volatile__
(gdb) Continuing.

Breakpoint 1, 0x0000000000400506 in main () at self_invalidate.c:10
10	__asm__ __volatile__
(gdb) Continuing.

Breakpoint 1, 0x0000000000400506 in main () at self_invalidate.c:10
10	__asm__ __volatile__
(gdb) Continuing.

Breakpoint 1, 0x0000000000400506 in main () at self_invalidate.c:10
10	__asm__ __volatile__
(gdb) Continuing.

Breakpoint 1, 0x0000000000400506 in main () at self_invalidate.c:10
10	__asm__ __volatile__
(gdb) Continuing.

Breakpoint 1, 0x0000000000400506 in main () at self_invalidate.c:10
10	__asm__ __volatile__
(gdb) (gdb) A debugging session is active.

	Inferior 1 [Remote target] will be detached.

Quit anyway? (y or n) [answered Y; input not from terminal]
Ending remote debugging.
gdbserver: continuing in 5000 ms ...
